import React from 'react';
import { ENG, RU, UA } from 'constants/language';

import Event1 from 'assets/images/events_1.jpg';
import Event2 from 'assets/images/event_2.jpg';
import { useLanguage } from 'hooks/useLanguage';
import { useHistory } from 'react-router';
import { Text } from 'styled/Text';
import { DefaultPage } from 'components/DefaultPage';

const HEADER = {
    [UA]: 'Участь в наукових заходах',
    [RU]: 'Участия в научных мероприятиях',
    [ENG]: 'Participation in scientific events',
};

const EVENTS_UA = [
    {
        header: 'ДОПОВІДЬ НА КОНФЕРЕНЦІЇ «ЕКОНОМІЧНА БЕЗПЕКА: АСПЕКТИ СПРОЩЕННЯ ТОРГІВЛІ ТА ЗАБЕЗПЕЧЕННЯ ЇЇ БЕЗПЕКИ» В БАКУ',
        text: '27 січня 2017 р завідувач кафедри стратегічного управління, д.т.н., проф. І. В. Кононенко зробив доповідь в м. Баку на науково-практичній конференції, присвяченій 25-річчю Державного митного комітету Азербайджанської Республіки, «Економічна безпека: аспекти спрощення торгівлі і забезпечення її безпеки». Тема доповіді: «Економічна складність як фактор економічної безпеки». У доповіді проф. І.В.Кононенко відзначив великі досягнення Азербайджану за роки незалежності і звернув увагу на значні резерви в області подальшого розвитку економіки. Він порівняв за індексом економічної складності п\'ять держав, близьких за чисельністю населення: Азербайджан, Австрію, Білорусію, Болгарію, Швейцарію і показав, що значення індексу економічної складності пов\'язані з індексом ефективності товарних ринків і з ВВП на душу населення. Для розглянутих країн зроблено висновок, що збільшення економічної складності сприяє стабільності експорту і збільшенню його обсягу. Економічна складність сприяє збільшенню економічної безпеки, впливаючи практично на всі її складові.',
        image: Event1,
    },
    {
        header: 'ДОПОВІДЬ НА Лондонському саміті ЛІДЕРІВ',
        text: '16-17 квітня 2014 р завідувач кафедри стратегічного управління проф. І.В.Кононенко взяв участь в Лондонському саміті лідерів – авторитетних зборах провідних фахівців світу в галузі розвитку міст. Тема саміту: швидка урбанізація: економіка, суспільство, менеджмент. В рамках саміту пройшло засідання секції Міжнародної конференції «Інтегроване стратегічне управління, управління проектами і програмами розвитку підприємств і міст». Організатором конференції є кафедра стратегічного управління НТУ «ХПІ». І.В.Кононенко зробив перший пленарний доповідь на тему: «Імітаційна модель науково-технологічного розвитку України» .Серед спікерів конференції: Ян Малкахи, керуючий директор Лондонського офісу компанії Gensler (Великобританія); Родні Тернер, професор управління проектами в SKEMABusinessSchool в Ліллі (Франція); Хіроші Танака, засновник Японської асоціації управління проектами. Всього в саміті взяли участь представники 35-ти країн світу. В ході пленарного засідання та інвестиційних сесій саміту потенційні інвестори, бізнесмени, вчені, автори принципово нових технологій в області вирішення завдань урбанізації запропонували інвестиційні проекти розвитку територій, програми з екологічної безпеки, а також створення комфортних умов для життя.',
        image: Event2,
    },
];

const EVENTS_RU = [
    {
        header: 'ДОКЛАД НА КОНФЕРЕНЦИИ «ЭКОНОМИЧЕСКАЯ БЕЗОПАСНОСТЬ: АСПЕКТЫ УПРОЩЕНИЯ ТОРГОВЛИ И ОБЕСПЕЧЕНИЯ ЕЕ БЕЗОПАСНОСТИ» В БАКУ',
        text: '27 января 2017 г. заведующий кафедрой стратегического управления, д.т.н., проф. И. В. Кононенко сделал доклад в г. Баку на научно-практической конференции, посвященной 25-летию Государственного таможенного комитета Азербайджанской республики, «Экономическая безопасность: аспекты упрощения торговли и обеспечения ее безопасности». Тема доклада: «Экономическая сложность как фактор экономической безопасности».\n' +
            'В докладе проф. И.В.Кононенко отметил большие достижения Азербайджана за годы независимости и обратил внимание на значительные резервы в области дальнейшего развития экономики. Он сравнил по индексу экономической сложности пять государств, близких по численности населения: Азербайджан, Австрию, Белоруссию, Болгарию, Швейцарию и показал, что значения индекса экономической сложности связаны с индексом эффективности товарных рынков и с ВВП на душу населения. Для рассматриваемых стран сделан вывод, что увеличение экономической сложности благоприятствует стабильности экспорта и увеличению его объема. Экономическая сложность способствует увеличению экономической безопасности, воздействуя практически на все ее составляющие.',
        image: Event1,
    },
    {
        header: 'ДОКЛАД НА ЛОНДОНСКОМ САММИТЕ ЛИДЕРОВ',
        text: '16-17 апреля 2014 г. заведующий кафедрой стратегического управления проф. И.В.Кононенко принял участие в Лондонском саммите лидеров – авторитетном собрании ведущих специалистов мира в области развития городов. Тема саммита: быстрая урбанизация: экономика, общество, менеджмент. В рамках саммита прошло заседание секции Международной конференции «Интегрированное стратегическое управление, управление проектами и программами развития предприятий и городов». Организатором конференции является кафедра стратегического управления НТУ «ХПИ». И.В.Кононенко сделал первый пленарный доклад на тему: «Имитационнаямодель научно-технологического развития Украины».Среди спикеров конференции: Ян Малкахи, управляющий директор Лондонского офиса компании Gensler (Великобритания); Родни Тернер, профессор управления проектами в SKEMABusinessSchool в Лилле (Франция); Хироши Танака, основатель Японской ассоциации управления проектами. Всего в саммите приняли участие представители 35-ти стран мира. В ходе пленарного заседания и инвестиционных сессий саммита потенциальные инвесторы, бизнесмены, ученые, авторы принципиально новых технологий в области решения задач урбанизации предложили инвестиционные проекты развития территорий, программы по экологической безопасности , а также создания комфортных условий для жизни.',
        image: Event2,
    },
];

const EVENTS = {
    [UA]: EVENTS_UA,
    [RU]: EVENTS_RU,
};

export const Events: React.FC = () => {
    const history = useHistory();
    const { language } = useLanguage();
    if (language === ENG) {
        history.push('/');
    }

    const renderProps = (event: { header: string, text: string, image: string }) => ({
        image: event.image,
        simpleHeader: true,
        children: {
            header: event.header,
            renderElement: () => (
                <Text className='text'>{event.text}</Text>
            ),
        },
    });
    return <div>
        {(language !== ENG && EVENTS[language].map(event => <DefaultPage {...renderProps(event)} />))}
    </div>;
};